Core Template MRF - kOmegaSST/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    nonCouple
    {
        type        faceZone;
        zoneName    innerCylinder;

        patches
        {
            owner
            {
                name        nonCouple1;
                type        patch;
            }

            neighbour
            {
                name        nonCouple2;
                type        patch;
            }
        }
    }
}


// ************************************************************************* //
